/*http://opk.afti.ru/tasks/hello-world 
Условие: 
*Написать программу, которая бы выводила строку "Hello, world!" на стандартный вывод.
*/
#include <stdio.h>

int main()
{
	printf("Hello, World!");
	//getchar(); use it if console close instantly
	return 0;
}